~Cases/buoyantFlow/solarChimney_v2112/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    glass
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    heaterTop
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    heaterSides
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    side
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    ground
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    chimney
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    symmetry1
    {
        type            symmetry;
    }
    symmetry2
    {
        type            symmetry;
    }
}


// ************************************************************************* //
