~Cases/buoyantFlow/solarChimney_v2112/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       0;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother  FDIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|h|e|k|epsilon|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.1;
    }

    ph_rgh
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-5;
        relTol          0.1;
    }

    "(U|h|e|k|epsilon|R)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    //- Correct the fluxes based on mesh motion. See header files of the solver
    correctPhi          false;

    //- Turn on of off the momentum predictor. In a numerical point of view
    //  not necessary. Useful for 2-phase and high viscosity ratios
    momentumPredictor   false;

    //- Calculate the turbulence in each outer loop or only at the end of one
    //  time step calculation. High turbulent flow calculation should calculate
    //  the turbulence properties in each outer loop
    turbOnFinalIterOnly true;

    //- Use the SIMPLE(C) := C =  consistent / corrected algorithm for
    //  the outer corrections. A pressure term that is neglected in the
    //  SIMPLE algorithm is included. More inner calculations but the
    //  coupling U-p in general is solved faster
    consistent          true;

    //- Mesh non-orthogonality correctors. Foam handles non-orthogonality quite
    //  good, so there is no need to use or only up to 2 - 3
    nNonOrthogonalCorrectors 0;

    //- Outer loops, re-calculation around p-U and other equations within
    //  one time step. For stiff problems while using under-relaxation
    nOuterCorrectors    20;

    //- Pressure corrections
    nCorrectors         2;

    //- Convergence criteria for the PIMPLE loop
    residualControl
    {
        p_rgh
        {
            relTol      0;
            tolerance   1e-4;
        }
    }
}

//- Relaxation factors applied to the fields or equations in the outer loops
//  If nOuterCorrectors is not used, no underrelaxation should be placed.
//  Always use the *.Final factor too, only you really know what your are doing
//  ++ Relaxation of the final outer correction is possible, if the residual
//     controls are very strict.
relaxationFactors
{
    //- Relaxation of the fields: See doxygen
    //  Range [0-1] while 0 does not change the field (no sense)
    fields
    {
        p_rgh             0.95;
        p_rghFinal        1;
    }
    //- Relaxation of the equation:
    //  Factor: -1 disables the usage
    //  Factor: 1 makes the matrix diagonal dominant or at least equal
    //          --> matrix might be manipulated
    //  Factor: 0 < alpha < 1; underrelaxation - make matrix diagonal dominat
    //  Factor: alpha > 1; over-relaxation - make matrix diagonal dominat weak
    //          --> can be used in some cases, generally not stable
    equations
    {
        "(k|epsilon|U)"           0.8;
        "(k|epsilon|U)Final"      1;
    }
}

// ************************************************************************* //
